package com.md.mdcms.base;

import java.util.Arrays;
import java.util.List;

public final class UnicodeConverter {

	private static final List<String> specialChar = Arrays.asList("&", "@",
			"â", "ä", "à", "á", "ã", "å", "ç", "ñ", "<", "é", "ê", "ë", "è",
			"í", "î", "ï", "ì", "ß", "Â", "Ä", "À", "Á", "Ã", "Å", "Ç", "Ñ",
			"¦", ">", "ø", "É", "Ê", "Ë", "È", "Í", "Î", "Ï", "Ì", "'", "\"",
			"Ø", "«", "»", "ð", "ý", "þ", "±", "°", "ª", "º", "æ", "¸", "Æ",
			"¤", "µ", "¡", "¿", "Ð", "Ý", "Þ", "®", "^", "£", "¥", "·", "©",
			"§", "¶", "¼", "½", "¾", "[", "¯", "¨", "´", "×", "­", "ô", "ö",
			"ò", "ó", "õ", "¹", "û", "ü", "ù", "ú", "ÿ", "÷", "²", "Ô", "Ö",
			"Ò", "Ó", "Õ", "³", "Û", "Ü", "Ù", "Ú");

	private static final List<String> specialCharUnicode = Arrays.asList(
			"&#38;", "&#64;", "&#226;", "&#228;", "&#224;", "&#225;", "&#227;",
			"&#229;", "&#231;", "&#241;", "&#60;", "&#233;", "&#234;",
			"&#235;", "&#232;", "&#237;", "&#238;", "&#239;", "&#236;",
			"&#223;", "&#194;", "&#196;", "&#192;", "&#193;", "&#195;",
			"&#197;", "&#199;", "&#209;", "&#166;", "&#62;", "&#248;",
			"&#201;", "&#202;", "&#203;", "&#200;", "&#205;", "&#206;",
			"&#207;", "&#204;", "&#39;", "&#34;", "&#216;", "&#171;", "&#187;",
			"&#240;", "&#253;", "&#254;", "&#177;", "&#176;", "&#170;",
			"&#186;", "&#230;", "&#184;", "&#198;", "&#164;", "&#181;",
			"&#161;", "&#191;", "&#208;", "&#221;", "&#222;", "&#174;",
			"&#162;", "&#163;", "&#165;", "&#183;", "&#169;", "&#167;",
			"&#182;", "&#188;", "&#189;", "&#190;", "&#172;", "&#175;",
			"&#168;", "&#180;", "&#215;", "&#173;", "&#244;", "&#246;",
			"&#242;", "&#243;", "&#245;", "&#185;", "&#251;", "&#252;",
			"&#249;", "&#250;", "&#255;", "&#247;", "&#178;", "&#212;",
			"&#214;", "&#210;", "&#211;", "&#213;", "&#179;", "&#219;",
			"&#220;", "&#217;", "&#218;");

	public static String forXml(String value) {
		// System.out.println("forXml value: " + value);
		for (int i = 0; i < specialChar.size() - 1; i++) {
			// if (value.equals("@") || value.contains("64")) {
			// System.out.println("forXml " + value);
			// }
			value = value
					.replace(specialChar.get(i), specialCharUnicode.get(i));
		}
		return value;
	}

	public static String forHtml(String value) {
		// System.out.println("forHtml value: " + value);
		for (int i = 0; i < specialChar.size() - 1; i++) {
			// if (value.equals("@") || value.contains("64")) {
			// System.out.println("forHtml " + value);
			// }
			value = value
					.replace(specialCharUnicode.get(i), specialChar.get(i));
		}
		return value;
	}

}
